/*
==========================================================

==========================================================
*/
#include "main_IF.h"



//—————————————————————————————————
//			選択コマンド
//—————————————————————————————————
extern const CHAR choiceName[CHOICE_MAX][MOZI_3] =
{
	"はい	",	
	"いいえ	",
};
//—————————————————————————————————
//			選択コマンド
//—————————————————————————————————
extern const CHAR mainCommand[MAIN_COM_MAX][MOZI_4] =
{
	"キャラ		",	
	"アイテム	",
	"たたかい	",
};
//—————————————————————————————————
//			選択コマンド
//—————————————————————————————————
extern const CHAR fightCommand[FIGHT_COM_MAX][MOZI_4] =
{
	"こうげき	",	
	"ぼうぎょ	",
	"スキル		",
	"持ち物		",	
};

//—————————————————————————————————
//			パラメーター名称
//—————————————————————————————————
extern const CHAR statusName[STATUS_MAX][MOZI_3] =
{
	"攻撃力	",		// 
	"防御力	",		// 
	"HP		",		// 
	"MP		",		// 
	"素早さ	",		// 
	"運		",		// 
};
//—————————————————————————————————
//			キャラクター名称
//—————————————————————————————————
extern const CHAR playerName[PLAYER_NAME_MAX][MOZI_4] =
{
	"ユーン	",
	"無一郎	",
	"煉獄	",
	"悲鳴嶼	",
	"不死川	",
};
//—————————————————————————————————
//			アイテム項目
//—————————————————————————————————
extern const CHAR itemName[ITEM_MAX][MOZI_3] =
{
	"武器	",
	"防具	",
	"装飾品	",
	"水晶	",
};
//—————————————————————————————————
//		各アイテム名称
//—————————————————————————————————
extern const CHAR itemNameTbl[ITEM_MAX][ITEM_NAME_MAX][MOZI_7] =
{
	{
		// 武器
		"大剣			",
		"片手剣			",
		"ランス			",
		"弓				",
		"無装備			",
	},
	{
		// 防具
		"スーツ			",
		"鋼鉄の鎧		",
		"賢者の鎧		",
		"忍者服			",
		"無装備			",
	},
	{
		// 装飾品
		"パワーチェイン	",
		"マジックリング	",
		"ガイヤバンクル	",
		"マント			",
		"無装備			",
	},
	{
		// 水晶
		"天眼石			",
		"藍銅鋼			",
		"方解石			",
		"赤鉄鉱			",
		"無装備			",
	},	
};
//—————————————————————————————————
//		キャラクターステータス
//—————————————————————————————————
extern const SHORT playerStuTbl[PLAYER_NAME_MAX][STATUS_MAX] = 
{
	//	攻撃力	防御	力	HP		MP		素早さ	運
	{	100,	50,		500,	100,	30,		5		},
	{	100,	5,		20,		20,		10,		2		},
	{	6,		8,		30,		25,		15,		3		},
	{	7,		9,		40,		30,		20,		4		},
	{	9,		11,		50,		35,		25,		5		},
};
//—————————————————————————————————
//		敵ステータス
//—————————————————————————————————
extern const SHORT enemyStuTbl[ENEMY_KIND_MAX	][STATUS_MAX] = 
{
	//	攻撃力	防御	力	HP		MP		素早さ	運
	{	500,	200,	8000,	300,	100,		10		},
	{	600,	200,	10000,	300,	100,		10		},
	{	700,	200,	12000,	300,	100,		10		},
	{	800,	200,	14000,	300,	100,		10		},
	{	900,	200,	20000,	300,	100,		10		},
};

//—————————————————————————————————
//		各アイテムパラメーター
//—————————————————————————————————
extern const SHORT itemStuTbl[ITEM_MAX][ITEM_NAME_MAX][STATUS_MAX] =
{
	{	//武器
		//	攻撃力	防御	力	HP		MP		素早さ	運
		{	100,	0,		0,		0,		10,		0		},	// 大剣
		{	80,		35,		0,		0,		30,		0		},	// 片手剣
		{	50,		100,	0,		0,		-20,	0		},	// ランス
		{	150,	-20,	0,		0,		50,		0		},	// 弓
		{	0,		0,		0,		0,		0,		100		},	// 無装備
	},
	{	//防具
		//	攻撃力	防御	力	HP		MP		素早さ	運
		{	0,		100,	40,		0,		30,		10		},	// スーツ
		{	0,		300,	0,		-50,	-50,	0		},	// 鋼鉄の鎧
		{	0,		100,	-20,	60,		0,		0		},	// 賢者の鎧
		{	0,		120,	0,		0,		80,		0		},	// 忍者服
		{	0,		0,		0,		0,		0,		100		},	// 無装備
	},
	{	//装飾品
		//	攻撃力	防御	力	HP		MP		素早さ	運
		{	100,	0,		100,	0,		0,		0		},	// パワーチェイン
		{	0,		0,		100,	100,	0,		0		},	// マジックリング
		{	0,		-30,	200,	30,		0,		0		},	// ガイヤバンクル
		{	-80,	-80,	300,	-80,	0,		0		},	// マント
		{	0,		0,		0,		0,		0,		100		},	// 無装備
	},
	{	//水晶
		//	攻撃力	防御	力	HP		MP		素早さ	運
		{	50,		50,		0,		100,	0,		0		},	// 天眼石
		{	0,		0,		70,		70,		60,		0		},	// 藍銅鋼
		{	-40,	-40,	-20,	300,	0,		0		},	// 方解石
		{	0,		0,		50,		200,	-50,	0		},	// 赤鉄鉱
		{	0,		0,		0,		0,		0,		100		},	// 無装備
	},
};
//—————————————————————————————————
//		各スキルパラメーター
//—————————————————————————————————
extern const SHORT skillParaTbl[SKILL_MAX][STATUS_MAX] =
{
	//	攻撃力	防御	力	HP		素早さ	運		消費MP	
	{	2,		0,		0,		0,		0,		10,		},
	{	5,		-2,		0,		0,		0,		10,		},
	{	0,		0,		0,		0,		0,		10,		},
	{	0,		0,		200,	20,		0,		10,		},
	{	-2,		5,		0,		0,		0,		0,		},
	{	100,	0,		0,		0,		30,		0,		},
	{	0,		0,		0,		0,		0,		0,		},
	{	10,		0,		500,	10,		0,		0,		},
};
extern const CHAR skillTurnTbl[SKILL_MAX] =
{	2,	0,	5,	0,	3,	0,	4,	0	};
//—————————————————————————————————
//		各スキル名称
//—————————————————————————————————
extern const UCHAR skillNameTbl[SKILL_MAX][MOZI_10] =
{
	" 攻撃強化		",
	" 捨て身の攻撃	",
	" 吸血化			",
	" 回復の術		",
	" 大防御			",
	" 幸福の鐘		",
	" 瞑想			",
	" 最後の足掻き 	",
};
//—————————————————————————————————
//		各スキル説明
//—————————————————————————————————
extern const UCHAR skillDescTbl[SKILL_MAX][MOZI_25] =
{
	"2ターンの間、攻撃力が2倍になる									",
	"攻撃力が5倍になるが、守備力が半減する							",
	"5ターンの間 攻撃後、ダメージの2倍HPが回復						",
	"HPが200回復し、素早さが20アップする								",
	"3ターン攻撃力が半減し素早さが0になるが、 防御力が5倍になる		",
	"攻撃力を100アップ、運が30アップする								",
	"HPを前回復する													",
	"HPが500回復し、攻撃力・素早さが10倍になるが、防御力は0になる		",
};
//—————————————————————————————————
//		各スキルパラメーター（敵）
//—————————————————————————————————
extern const CHAR skillParaEnTbl[SKILL_MAX][STATUS_MAX] =
{
	//	攻撃力	防御	力	HP		素早さ	運		消費MP			
	{	0,		0,		0,		0,		0,		10,		},
	{	0,		0,		0,		0,		0,		10,		},
	{	0,		0,		0,		0,		0,		10,		},
	{	0,		0,		0,		0,		0,		10,		},
	{	0,		0,		0,		0,		0,		10,		},
};
//—————————————————————————————————
//		スキル名称（敵）
//—————————————————————————————————
extern const CHAR skillNameEnTbl[SKILL_MAX][MOZI_10] =
{
	"	",
	"	",
	"	",
	"	",
	"	",
	"	",
	"	",
	"	",
};
//—————————————————————————————————
//		スキル説明（敵）
//—————————————————————————————————
extern const CHAR skillDescEnTbl[SKILL_MAX][MOZI_10] =
{
	"	",
	"	",
	"	",
	"	",
	"	",
	"	",
	"	",
	"	",
};
